[
    {
        "country": "Nigeria",
        "fact": [
            "As of 2021, Nigeria boasts over 60 million English speakers, making it one of the largest English-speaking countries globally.",
            "As of 2021, more than 30 million Nigerians speak Nigerian Pidgin, a widely used creole language.",
            "English serves as Nigeria's official language and is spoken as a second language by millions.",
            "In educated and urban settings, English is becoming a primary language.",
            "Nigerian Pidgin predominates in informal settings like markets, public transport, and among the less affluent.",
            "For many educated Nigerians, 'English' means 'standard English,' and the 'ideal' form of which is British English.",
            "The formal types of English dominate in politics, media, business, and formal education.",
            "Nigerian Pidgin is increasingly seen in formal contexts like advertisements and political speeches.",
            "Nigerian English lacks an authoritative grammar or dictionary.",
            "Renowned authors like Chinua Achebe and Wole Soyinka incorporate Nigerian Pidgin into their literary works."
        ]
    },
    {
        "country": "Kenya",
        "fact": [
            "English, alongside Swahili, is an official language in Kenya, largely considered the lingua franca.",
            "Despite being less common than native languages, English dominates in media, government, and schools.",
            "In Kenya, English is the primary medium of instruction from grade one in urban areas and grade four in rural regions.",
            "Radios and daily newspapers in Kenya predominantly broadcast and publish content in English.",
            "Nairobi's shops and essential services predominantly utilize English signage for easy operation by English-speaking visitors.",
            "Billboards are written in English on one side of the board with a translation into a local language or Kiswahili on the other side.",
            "There is a wide rural-urban disparity in English usage as English's widespread use in towns contrasts with limited usage in rural areas, primarily limited to schools.",
            "Urban elites often use English as a class marker and within interpersonal interactions, associating with educated circles.",
            "English remains the sole medium of instruction and language of research in colleges and universities.",
            "Ngugi wa Thiong’o, a prominent Kenyan writer, influenced attitudes towards English, advocating for the preservation of local languages."
        ]
    },
    {
        "country": "Cameroon",
        "fact": [
            "According to the 2005 census, 23% of the population speak English.",
            "Cameroon Pidgin English (CPE) is widely used not only in the North-West and South-West provinces but also in the Littoral and West provinces.",
            "The perception of Cameroon Pidgin English has evolved beyond a regional lingua franca to potentially having a national dimension.",
            "In both urban and rural settings, Cameroon Pidgin English thrives, prevalent in churches, markets, transport hubs, and informal gatherings.",
            "Cameroonian Pidgin English goes by the colloquial name 'Kamtok,' derived from 'Cam(eroon) talk.'",
            "English shares official language status in Cameroon with French.",
            "English serves as the primary language of instruction across secondary schools and higher education institutions in Cameroon.",
            "French-English bilingualism is being promoted through special bilingual primary and secondary schools like the Bilingual Grammar school at Molyko-Buca.",
            "Despite constitutional equality, French holds a *de facto* dominance in administration, education, and media over English in Cameroon.",
            "Missionaries introduced English as the initial western language in Cameroonian education."
        ]
    }
]
