[
    {
      "country": "Nigeria",
      "fact": [
        "English is the official language of Nigeria, spoken by millions as a second language.",
        "Nigeria has a diverse linguistic landscape with over 500 languages, making English a unifying language.",
        "The Nigerian English accent varies across different regions and ethnic groups.",
        "Nigeria's literary scene boasts globally acclaimed authors like Chinua Achebe and Wole Soyinka.",
        "English is essential for business and government affairs in Nigeria.",
        "Nigerian Pidgin English is widely spoken as a creole language.",
        "Nigeria's educational system emphasizes English proficiency.",
        "The use of English in Nigerian music and entertainment contributes to its cultural influence.",
        "The Nigerian English lexicon incorporates indigenous words from various ethnic languages.",
        "English language proficiency is a significant advantage for job opportunities in Nigeria."
      ]
    },
    {
      "country": "Kenya",
      "fact": [
        "English serves as a primary language in education and government in Kenya.",
        "Kenya's diverse cultural heritage is reflected in its English language usage.",
        "Kenyans often code-switch between English and local languages in daily conversations.",
        "Kenyan literature, like Ngũgĩ wa Thiong'o's works, has gained international acclaim.",
        "English proficiency is a crucial skill for economic growth and job prospects in Kenya.",
        "Kenya's media extensively uses English in newspapers, TV, and radio broadcasts.",
        "English is vital in Kenya's tourism sector, facilitating communication with visitors.",
        "Kenya's urban centers exhibit variations in spoken English influenced by local dialects.",
        "English serves as a language of opportunity and social mobility for many Kenyans.",
        "English education is considered a key factor in career advancement in Kenya."
      ]
    },
    {
      "country": "Cameroon",
      "fact": [
        "Cameroon's linguistic diversity includes English and French as official languages.",
        "Cameroon's Anglophone and Francophone regions contribute to bilingualism.",
        "English proficiency is crucial for employment opportunities in Cameroon.",
        "The use of Cameroonian Pidgin English is prevalent in informal communication.",
        "Cameroon has a rich literary tradition in both English and French languages.",
        "English is integral to Cameroon's legal and educational systems.",
        "Cameroonian youths often blend English with local slang and expressions.",
        "The English language serves as a bridge between Cameroon's diverse communities.",
        "Cameroon's business landscape often requires English fluency for international dealings.",
        "Cameroonians view English as a gateway to global communication and connectivity."
      ]
    }
  ]
  